app/Controllers/Groups.php

    public function detail($id_groups)
    {
        $session = session();
        $sessionUserId = $session->get('id_user');

        $group = $this->groupsModel
            ->select('groups.*, user.username AS creator_name')
            ->join('user', 'user.id_user = groups.created_by')
            ->where('groups.id_groups', $id_groups)
            ->first();

        if (!$group) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Grup tidak ditemukan.');
        }

        // SELECT yang lengkap biar yakin semua kolom dibawa
        $members = $this->membersModel
            ->select('members.id_user, members.member_level, user.username')
            ->join('user', 'user.id_user = members.id_user')
            ->where('members.id_groups', $id_groups)
            ->findAll();
---
SELECT `members`.`id_user`, `members`.`member_level`, `user`.`username`
FROM `members`
JOIN `user` ON `user`.`id_user` = `members`.`id_user`
WHERE `members`.`id_groups` = '5'