app/Controllers/Groups.php

SELECT `groups`.*, `user`.`username` AS `creator_name`
FROM `groups`
JOIN `user` ON `user`.`id_user` = `groups`.`created_by`
---
    public function __construct()
    {
        $this->groupsModel = new GroupsModel();

SELECT `groups`.*, `user`.`username` AS `creator_name`
FROM `groups`
JOIN `user` ON `user`.`id_user` = `groups`.`created_by`
JOIN `members` ON `members`.`id_groups` = `groups`.`id_groups`
WHERE `members`.`id_user` = '10'
---
    public function index()
    {
        $sessionUserId = session()->get('id_user');

        // Query untuk menampilkan grup yang memiliki user yang sedang login sebagai member
        $groups = $this->groupsModel
            ->select('groups.*, user.username AS creator_name')
            ->join('user', 'user.id_user = groups.created_by') // Menambahkan informasi pembuat grup
            ->join('members', 'members.id_groups = groups.id_groups') // Menggabungkan tabel members
            ->where('members.id_user', $sessionUserId) // Filter untuk hanya grup yang memiliki user ini sebagai member
            ->findAll();

SELECT *
FROM `groups`
WHERE `groups`.`id_groups` = '5'
---
    public function store()
    {
        if (!$this->validate([
            'group_name' => 'required|max_length[100]',
            'password'   => 'permit_empty|min_length[6]',
            'photo'      => 'permit_empty|is_image[photo]|max_size[photo,1024]|mime_in[photo,image/jpg,image/jpeg,image/png]',
        ])) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $data = [
            'group_name'   => $this->request->getVar('group_name'),
            'created_by'   => session()->get('id_user') ?? 1,
            'created_date' => date('Y-m-d H:i:s'),
            'password'     => $this->hashPassword($this->request->getVar('password')),
            'description'  => $this->request->getVar('description'),
        ];

        if ($photo = $this->uploadPhoto()) {
            $data['photo'] = $photo;
        }

        // Insert grup ke dalam database
        if ($this->groupsModel->insert($data)) {
            // Dapatkan ID grup yang baru ditambahkan
            $groupId = $this->groupsModel->getInsertID();

            // Tambahkan member yang membuat grup secara otomatis
            $this->membersModel->insert([
                'id_groups' => $groupId,
                'id_user' => session()->get('id_user'),
                'member_level' => 'admin', // Pengguna yang membuat grup menjadi admin
            ]);

SELECT *
FROM `groups`
WHERE `groups`.`id_groups` = '5'
SELECT *
FROM `user`
---
    public function addMember($id_groups)
    {
        $group = $this->groupsModel->find($id_groups);
        if (!$group) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Grup tidak ditemukan.');
        }

        // Menampilkan hanya user yang belum menjadi member
        $existingMembers = $this->membersModel->where('id_groups', $id_groups)->findColumn('id_user');
        $users = $this->userModel->whereNotIn('id_user', $existingMembers)->findAll();

SELECT *
FROM `members`
WHERE `id_groups` = '5'
---
    public function storeMember($id_groups)
    {
        $id_user = $this->request->getVar('id_user');
        $level = $this->request->getVar('member_level');

        // Validasi input
        if (!$id_user || !$level) {
            return redirect()->back()->with('errors', 'User dan level wajib diisi.');
        }

        // Simpan data member baru
        $this->membersModel->insert([
            'id_groups' => $id_groups,
            'id_user' => $id_user,
            'member_level' => $level,
        ]);

        return redirect()->to('/groups/detail/' . $id_groups)->with('success', 'Member berhasil ditambahkan.');

SELECT `groups`.*, `user`.`username` AS `creator_name`
FROM `groups`
JOIN `user` ON `user`.`id_user` = `groups`.`created_by`
WHERE `groups`.`id_groups` = '9'
 LIMIT 1
SELECT *
FROM `user`
WHERE `user`.`id_user` = '1'
SELECT *
FROM `members`
JOIN `user` ON `user`.`id_user` = `members`.`user_id`
WHERE `id_groups` = '9'
---
    public function removeMember($id_groups, $id_user)
    {
        // Pastikan member benar-benar ada
        $this->membersModel
            ->where('id_groups', $id_groups)
            ->where('id_user', $id_user)
            ->delete();

        return redirect()->to('/groups/detail/' . $id_groups)->with('success', 'Member berhasil dihapus.');

SELECT `groups`.*, `user`.`username` AS `creator_name`
FROM `groups`
JOIN `user` ON `user`.`id_user` = `groups`.`created_by`
WHERE `groups`.`id_groups` = '5'
 LIMIT 1
SELECT *
FROM `members`
JOIN `user` ON `user`.`id_user` = `members`.`user_id`
WHERE `id_groups` = '5'
---
    public function detail($groupId)
    {
        $data['group'] = $this->groupsModel
            ->select('groups.*, user.username AS creator_name')
            ->join('user', 'user.id_user = groups.created_by')
            ->where('groups.id_groups', $groupId)
            ->first();

        if (!$data['group']) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Grup tidak ditemukan');
        }

        $data['members'] = $this->membersModel
            ->select('members.*, user.username')
            ->join('user', 'user.id_user = members.id_user')
            ->where('id_groups', $groupId)
            ->findAll();

        $data['sessionUserId'] = session()->get('id_user');

        // ⬇ Tambahkan ini
        $data['users'] = $this->userModel->findAll();