app/Controllers/Tugas.php

    public function index()
    {
        $model = new TugasModel();
        $tugas = $model->findAll();
---
SELECT *
FROM `tugas`

    public function detail($id)
    {
        $tugasModel = new TugasModel();
        $attachmentModel = new AttachmentModel();
        $userModel = new UserModel();
        $groupsModel = new GroupsModel();
        $sharedModel = new SharedModel(); // Menambahkan model SharedModel untuk shared tasks

        // Ambil data tugas
        $tugas = $tugasModel->find($id);

        // Ambil data attachment terkait tugas
        $attachments = $attachmentModel->where('id_tugas', $id)->findAll();

        // Ambil semua user
        $users = $userModel->findAll();

        // Ambil semua grup (atau sesuai kebutuhan kamu bisa menambah filter untuk grup)
        $groups = $groupsModel->findAll();

        // Ambil daftar shared users
        $sharedUsers = $sharedModel
                        ->join('user', 'user.id_user = shared.id_user') // Join dengan tabel user untuk mendapatkan nama penerima
                        ->where('id_tugas', $id)
                        ->findAll();
---
SELECT *
FROM `tugas`
WHERE `tugas`.`id` = '20'
SELECT *
FROM `attachment`
WHERE `id_tugas` = '20'
SELECT *
FROM `user`
SELECT *
FROM `groups`
SELECT *
FROM `shared`
JOIN `user` ON `user`.`id_user` = `shared`.`id_user`
WHERE `id_tugas` = '20'

    public function share($id = null)
    {
        if ($id === null) {
            return redirect()->to('/tugas')->with('error', 'ID tugas tidak ditemukan.');
        }

        $tugasModel = new TugasModel();
        $userModel = new UserModel();

        $data['tugas'] = $tugasModel->find($id);
        if (!$data['tugas']) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException("Tugas dengan ID $id tidak ditemukan.");
        }

        $data['users'] = $userModel->where('id_user !=', session()->get('id_user'))->findAll();
---
SELECT *
FROM `tugas`
WHERE `tugas`.`id` = '19'
SELECT *
FROM `user`
WHERE `id_user` != '1'

    public function storeShare($id)
    {
        $sharedModel = new SharedModel();
        $userId = $this->request->getPost('user_id');
        $currentUserId = session()->get('id_user');

        // Cek apakah sudah dibagikan
        $alreadyShared = $sharedModel
            ->where('id_tugas', $id)
            ->where('id_user', $userId)
            ->first();

        if ($alreadyShared) {
            return redirect()->back()->with('error', 'Tugas sudah pernah dibagikan ke user ini.');
---
SELECT *
FROM `user`
WHERE `user`.`id_user` = '7'