app/Controllers/Tugas.php

SELECT *
FROM `tugas`
WHERE `creator_id` = '1'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `tugas`
WHERE `creator_id` = '1'
---
    public function index()
    {
        $userId = session()->get('id_user');
        $keyword = $this->request->getGet('keyword');
        $perPage = 10;

        if (!$userId) {
            return redirect()->to('/login')->with('error', 'Anda harus login terlebih dahulu.');
        }

        $query = $this->tugasModel->where('creator_id', $userId);

        if ($keyword) {
            $query->like('tugas', $keyword);
        }

        $tugas = $query->paginate($perPage);

SELECT *
FROM `user`
WHERE `id_user` != '1'
---
    public function update($id)
    {
        $data = [
            'tugas' => $this->request->getPost('tugas'),
            'tanggal' => $this->request->getPost('tanggal'),
            'waktu' => $this->request->getPost('waktu'),
            'status' => $this->request->getPost('status'),
            'alarm' => $this->request->getPost('alarm'),
            'date_due' => $this->request->getPost('date_due'),
            'time_due' => $this->request->getPost('time_due'),
            'date_finished' => $this->request->getPost('date_finished'),
            'time_finished' => $this->request->getPost('time_finished'),
            'creator_id' => session()->get('id_user')
        ];

SELECT `shared`.*, `tugas`.`tugas`, `tugas`.`id` as `tugas_id`
FROM `shared`
JOIN `tugas` ON `tugas`.`id` = `shared`.`id_tugas`
WHERE `shared`.`id_user` = '1'
---
    public function sharedToMe()
    {
        $id_user = session()->get('id_user');
        $sharedTugas = $this->sharedModel
            ->join('tugas', 'tugas.id = shared.id_tugas')
            ->select('shared.*, tugas.tugas, tugas.id as tugas_id')
            ->where('shared.id_user', $id_user)
            ->findAll();