app/Controllers/User.php

SELECT *
FROM `user`
WHERE `user`.`id_user` = '10'
---
    public function update($id_user)
{
    $model = new UserModel();
    $user = $model->find($id_user);

SELECT *
FROM `user`
WHERE `user`.`id_user` = '10'
---
    public function profile()
{
    $userId = session()->get('id_user');
    $model = new UserModel();

    // Ambil data user berdasarkan id_user yang ada di session
    $data['user'] = $model->find($userId);