app/Models/FriendshipModel.php

SELECT `user`.`username`, `user`.`photo`, `friendships`.*
FROM `friendships`
JOIN `user` ON `user`.`id_user` = IF(friendships.id_user = 1, friendships.id_friend, friendships.id_user)
WHERE `friendships`.`status` = 'accepted'
AND   (
`friendships`.`id_user` = '1'
OR `friendships`.`id_friend` = '1'
 )
---
    public function getFriends($userId)
    {
        return $this->select('user.username, user.photo, friendship.*')
            ->join('user', 'user.id_user = IF(friendship.id_user = ' . $userId . ', friendship.id_friend, friendship.id_user)')
            ->where('friendship.status', 'accepted')
            ->groupStart()
                ->where('friendship.id_user', $userId)
                ->orWhere('friendship.id_friend', $userId)
            ->groupEnd()
            ->findAll();

SELECT `user`.`username`, `user`.`photo`, `friendships`.*
FROM `friendships`
JOIN `user` ON `user`.`id_user` = `friendships`.`id_user`
WHERE `friendships`.`id_friend` = '1'
AND `friendships`.`status` = 'pending'
---
    public function getFriendRequests($userId)
    {
        return $this->select('user.username, user.photo, friendship.*')
            ->join('user', 'user.id_user = friendship.id_user')
            ->where('friendship.id_friend', $userId)
            ->where('friendship.status', 'pending')
            ->findAll();

SELECT `user`.`username`, `user`.`photo`, `friendships`.*
FROM `friendships`
JOIN `user` ON `user`.`id_user` = `friendships`.`id_friend`
WHERE `friendships`.`id_user` = '1'
AND `friendships`.`status` = 'pending'
---
    public function getSentRequests($userId)
    {
        return $this->select('user.username, user.photo, friendship.*')
            ->join('user', 'user.id_user = friendship.id_friend')
            ->where('friendship.id_user', $userId)
            ->where('friendship.status', 'pending')
            ->findAll();