app/Models/GroupsModel.php

    public function getGroupsWithCreatorName()
{
    return $this->select('groups.*, user.username AS creator_name')
                ->join('user', 'user.id_user = groups.created_by')
                ->findAll();
---
SELECT `groups`.*, `user`.`username` AS `creator_name`
FROM `groups`
JOIN `user` ON `user`.`id_user` = `groups`.`created_by`